УТ_для_edt/src/Documents/смартПредзаказПоставщику/смартПредзаказПоставщику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>смартПредзаказПоставщику</name>
  <comment>#1637 смарт Ермаков 14.02.2024 / Рефакторинг объектов &quot;Предзаказ поставщику&quot;</comment>
  <basedOn>Document.ЗаказКлиента</basedOn>
  <basedOn>Document.ЗаказНаСборку</basedOn>
  <registerRecords>AccumulationRegister.смартПредзаказыПоставщикам</registerRecords>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>НалогообложениеНДС</name>
    <type>
      <types>EnumRef.ТипыНалогообложенияНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПоДаннымПоставщика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоДаннымПоставщика</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склады</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ЗаказНаСборку</types>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрогнозГотовностиУПоставщика</name>
    <comment>#Б-3262 смарт: Лопато 14.05.2025 //Доработать отчет &quot;Остатки и доступность товаров&quot;. Добавить информацию о прогнозном сроке изготовления.</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>НоменклатураПартнера</name>
      <type>
        <types>CatalogRef.НоменклатураКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <type>
        <types>CatalogRef.Назначения</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦеныПоставщика</name>
      <type>
        <types>CatalogRef.ВидыЦенПоставщиков</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентРучнойСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРучнойСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПоступления</name>
      <comment>#4552 смарт: Тимофеева 01.10.2025 / Автозаказ. Формирование предзаказов по потребностям.</comment>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаПошлины</name>
      <comment>#6726  смарт: Тимофеева 22.05.2026 / Предзаказ поставщику. Доработка документа. Новые реквизиты Пошлина и Таможенный сбор.</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПовышенныйТаможенныйСбор</name>
      <comment>#6726  смарт: Тимофеева 22.05.2026 / Предзаказ поставщику. Доработка документа. Новые реквизиты Пошлина и Таможенный сбор.</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_для_edt/src/AccumulationRegisters/смартПредзаказыПоставщикам/смартПредзаказыПоставщикам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>смартПредзаказыПоставщикам</name>
  <resources>
    <name>Заказано</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>НомерПоДаннымПоставщикаУдалить</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоДаннымПоставщикаУдалить</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПредзаказПоставщику</name>
    <type>
      <types>DocumentRef.смартПредзаказПоставщику</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Назначение</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

УТ_для_edt/src/Enums/ТипыНалогообложенияНДС/ТипыНалогообложенияНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНалогообложенияНДС</name>
  <enumValues>
    <name>НалоговыйАгентПоНДС</name>
  </enumValues>
  <enumValues>
    <name>ПоФактическомуИспользованию</name>
  </enumValues>
  <enumValues>
    <name>ПродажаНаЭкспорт</name>
  </enumValues>
  <enumValues>
    <name>ПродажаНеОблагаетсяНДС</name>
  </enumValues>
  <enumValues>
    <name>ПродажаОблагаетсяЕНВД</name>
  </enumValues>
  <enumValues>
    <name>ПродажаОблагаетсяНДС</name>
  </enumValues>
  <enumValues>
    <name>ЭкспортСырьевыхТоваровУслуг</name>
  </enumValues>
  <enumValues>
    <name>ЭкспортНесырьевыхТоваров</name>
  </enumValues>
  <enumValues>
    <name>ВводОСВЭксплуатацию</name>
  </enumValues>
  <enumValues>
    <name>ОпределяетсяРаспределением</name>
  </enumValues>
  <enumValues>
    <name>ОблагаетсяНДСУПокупателя</name>
  </enumValues>
  <enumValues>
    <name>ПроизводствоСДЦ</name>
  </enumValues>
  <enumValues>
    <name>ЭлектронныеУслуги</name>
  </enumValues>
  <enumValues>
    <name>РеализацияРаботУслугНаЭкспорт</name>
  </enumValues>
  <enumValues>
    <name>ПродажаПоПатенту</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Documents/смартПредзаказПоставщику/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

//++ #1637 смарт Ермаков 14.02.2024 / Рефакторинг объектов "Предзаказ поставщику"
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПроведениеСерверУТ.УстановитьРежимПроведения(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	
	ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
КонецПроцедуры //-- #1637 смарт Ермаков 14.02.2024

//++ #1637 смарт Ермаков 14.02.2024 / Рефакторинг объектов "Предзаказ поставщику"
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Инициализация дополнительных свойств для проведения документа
	ПроведениеСерверУТ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);
	
	// Инициализация данных документа
	Документы.смартПредзаказПоставщику.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	ПроведениеСерверУТ.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	смартСервер.ОтразитьПредзаказыПоставщикам(ДополнительныеСвойства, Движения, Отказ);
	
	СформироватьСписокРегистровДляКонтроля();
	
	// Запись наборов записей
	ПроведениеСерверУТ.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	ПроведениеСерверУТ.ВыполнитьКонтрольРезультатовПроведения(ЭтотОбъект, Отказ);
	ПроведениеСерверУТ.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	
КонецПроцедуры //++ #1637 смарт Ермаков 14.02.2024

//++ #1637 смарт Ермаков 14.02.2024 / Рефакторинг объектов "Предзаказ поставщику"
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	//++ #1637 смарт Ермаков 14.02.2024 / Рефакторинг объектов "Предзаказ поставщику"
	// Перенесено из расширения
	
	Если ТипЗнч(ДанныеЗаполнения)=Тип("Структура") И ДанныеЗаполнения.Свойство("ТоварыКЗаказу") Тогда 
		Для Каждого Стр Из ДанныеЗаполнения.ТоварыКЗаказу Цикл 
			ЗаполнитьЗначенияСвойств(Товары.Добавить(),Стр);
		КонецЦикла;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения)=Тип("ДокументСсылка.ЗаказКлиента") Тогда
		ДокументОснование=ДанныеЗаполнения;
		Склады=ДанныеЗаполнения.Склад;
		
		//++ смарт:КМД #3_2 179 28.12.2020
		Организация = ДанныеЗаполнения.Организация;
		//-- смарт:КМД #3_2 179 28.12.2020
		
		Для Каждого Стр Из ДанныеЗаполнения.Товары Цикл 
			ЗаполнитьЗначенияСвойств(Товары.Добавить(),Стр,"Номенклатура,Характеристика,Упаковка,КоличествоУпаковок,Количество");
		КонецЦикла;	
		
	//++ смарт:ММ #095 458 13.02.2021 На основании заказа на сборку создавать предзаказ поставщику
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказНаСборку") Тогда
		
		ДокументОснование 	= ДанныеЗаполнения;
		Склады 				= ДанныеЗаполнения.Склад;		
		Организация 		= ДанныеЗаполнения.Организация;
		
		Для Каждого Стр Из ДанныеЗаполнения.Товары Цикл 
			ЗаполнитьЗначенияСвойств(Товары.Добавить(), Стр,"Номенклатура,Характеристика,Упаковка,КоличествоУпаковок,Количество");
		КонецЦикла;
		
	//-- смарт:ММ 13.02.2021
	
	КонецЕсли;
	НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС;
	
	СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(ЭтотОбъект);
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
	СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС", Новый Структура("НалогообложениеНДС, Дата", НалогообложениеНДС, Дата));
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	ОбработкаТабличнойЧастиСервер.ОбработатьТЧ(Товары,СтруктураДействий, Неопределено);
	
	//++ #1637 смарт Ермаков 14.02.2024 / Рефакторинг объектов "Предзаказ поставщику"
	
КонецПроцедуры //++ #1637 смарт Ермаков 14.02.2024

//++ #1637 смарт Ермаков 14.02.2024 / Рефакторинг объектов "Предзаказ поставщику"
Процедура ПриКопировании(ОбъектКопирования)
	
	ДокументОснование = Неопределено;
	
КонецПроцедуры //-- #1637 смарт Ермаков 14.02.2024

//++ #1637 смарт Ермаков 14.02.2024 / Рефакторинг объектов "Предзаказ поставщику"
Процедура ОбработкаУдаленияПроведения(Отказ)

	//++ #1637 смарт Ермаков 14.02.2024 / Рефакторинг объектов "Предзаказ поставщику"
	// Перенесено из расширения  
	// Переделать под стандарты
	
	Запрос=Новый Запрос;
	Запрос.УстановитьПараметр("ПредзаказПоставщику",Ссылка);
	Запрос.Текст="ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	             |	смартПредзаказыПоставщикам.Регистратор КАК Регистратор
	             |ИЗ
	             |	РегистрНакопления.смартПредзаказыПоставщикам КАК смартПредзаказыПоставщикам
	             |ГДЕ
	             |	смартПредзаказыПоставщикам.ПредзаказПоставщику = &ПредзаказПоставщику
	             |	И НЕ смартПредзаказыПоставщикам.Регистратор = &ПредзаказПоставщику";
	МассивПодчиненных=Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Регистратор");
	Если МассивПодчиненных.Количество() Тогда
		ТекстОшибки="У предзаказа есть подчиненные документы:";
		Для Каждого Док Из МассивПодчиненных Цикл 
			ТекстОшибки=ТекстОшибки+"
						|"+Док;
		КонецЦикла;
		ТекстОшибки=ТекстОшибки+"
					|Предзаказ не может быть распроведен.";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,,,,Отказ);
	КонецЕсли;	
	//-- #1637 смарт Ермаков 14.02.2024 / Рефакторинг объектов "Предзаказ поставщику"
	
КонецПроцедуры //++ #1637 смарт Ермаков 14.02.2024

#КонецОбласти

#Область Прочее

//++ #1637 смарт Ермаков 14.02.2024 / Рефакторинг объектов "Предзаказ поставщику"
Процедура СформироватьСписокРегистровДляКонтроля()
	
	Массив = Новый Массив;
	Массив.Добавить(Движения.смартПредзаказыПоставщикам);
	
	ДополнительныеСвойства.ДляПроведения.Вставить("РегистрыДляКонтроля", Массив);

КонецПроцедуры //-- #1637 смарт Ермаков 14.02.2024

#КонецОбласти

#КонецЕсли
